[LiveUpdate_FormLiveUpdateMain]
btnClose.Hint=Închide
btnUpdate.Caption=Descarcă
btnConfirmCancel.Caption=Anulează
btnUptoDateOK.Caption=OK
lblUpToDate.Caption=Felicitări! Ai deja ultima versiune. Nu există alte actualizări.
lblGetUptInfo.Caption=Preiau informațiile despre actualizări, așteaptă...
btnConfigCancel.Caption=Anulează
btnMinimize.Caption=Minimizează
btnProcessCancel.Caption=Anulează
btnUptWeb.Caption=Actualizează Acum
btnWebCancel.Caption=Actualizează Ulterior
lblUpdateFailed.Caption=Actualizarea a eșuat! Încearcă din nou mai tîrziu. Sau clichează pe butonul "Reîncearcă" pentru a face asta acum.
btnFailedClose.Caption=Închide
btnRetry.Caption=Reîncearcă
btnSuccessClose.Caption=OK

[LiveUpdate_M]
Item=Item
Size=Mărime
Version=Versiune
DownLoading=Descarc
OK=OK
Close=Închide
LiveUpdate=Actualizează
UpdateSuccess=%s a fost actualizat. Poți beneficia chiar acum de ultimele funcții și îmbunătățiri.
WebDownLoad=E disponibilă o versiune nouă de %s. Actualizează acum pentru a beneficia de ultimele funcții și îmbunătățiri. Este gratuit.
AvailableUpdates=Actualizări Disponibile
NewVersion=Versiune Nouă
VersionUpdate=Actualizare la Versiunea
ImportantUpdate=Actualizare Importantă

